[Oreans]

&New = Naujas
&Open... = Atverti...
&Save = Išsaugoti
Save &As... = Įrašyti kaip
&Protect = Apsaugoti
&Help = Pagalba
About... = Apie...
Demo Version = Demo Versija
Save = Išsaugoti

Options = Nustatymai
Application Information = Aplikacijos Informacija
Protection Options = Apsaugos Nustatymai
Code Replace = Kodo Keitimas
Virtual Machine = Virtuali Mašina
Customized Dialogs = Individualūs Dialogai
Advanced Options = Papildomi Nustatymai
XBundler = XBundler
Help = Pagalba
Registration = Registracija
Trial Settings = Bandomosios Nustatymai
Hardware Lock = Aparatinis Fiksavimas
Password Protection = Slaptažodžio Apsauga
Soft&ware = Programinė Įranga
&Customers = Klientai
&License Manager = Licenzijų Valdymas
&Managers = Tvarkytojai
&Project = Projektas
Tools = Įrankiai
H&elp = Pagalba
&Contents = Turinys
&About = Apie
Export Generators = Eksportavimo Generatoriai
&Software = Programinė įranga
&License = Licenzija
Password = Slaptažodis
Trial Extension = Bandomosios Plėtiniai
&Exit = Išeiti
P&rotect = Apsaugoti
Open Project = Atverti Projektą
New Project = Naujas Projektas
Save Project = Išsaugoti Projektą
Save Project As... = Išsaugoti Projektą Kaip...
Protect File = Apsaugoti Bylą
Dupli&cate = Dubliuot
(Double click to select) = (tam, kad pasirinkti spustelkite du kartus)


Application = Aplikacija
Version = Versija
Input Filename = Įvesties Bylos vardas
Output Filename = Išvesties bylos vardas
File Size = Bylos dydis
File Information = Bylos Informacija
Get from version info = Gauti Versijos Informaciją
File not found = Byla nerasta
Refresh = Perkrauti
Same as input = Kaip ir įvesties

Advanced Anti-Debugger = Išplėstinis anti-derintojas
Enable Protection = Įjungti apsaugą
Advanced API-Wrapping = Išplėstinė API-sąsajos apgaubtis
Anti Dumpers = Apsaugoti nuo atminties išklotinių (Anti Dumpers)
Entry Point Obfuscation = Įėjimo taško slėpimas
Anti-Patching = Anti-Lopymas
None = Nėra
File Patching = Bylų lopymas
Compression = Kompresija
Resources = Resursai
Monitor Blockers = Stebėtojų Blokavimai
Files Monitors = Bylų Stebėtojai
Registry Monitors = Registrų Stebėtojai
Delphi/BCB Form Protection = Delphi/BCB formų apsauga
Memory Guard = Atminties Sargas
Resources Encryption = Resursų Kodavimas
VMWare/Virtual PC = VMWare/Virtual PC
Compatible = Suderinamas
When Debugger Found = Kai Derintojas Aptiktas
Enable Encryption = Įjungti Kodavimą
Display Message = Parodyti Žinutę
Exit Silently = Baigti Tyliai Darbą
Crash Application = Trenksmingai (crash) Nutraukti Aplikaciją
Metamorph Security = Metamorfinė Apsauga
Ring-0 Protection = Ring-0 Apsauga
(not available in DEMO) = (negalima DEMO versijoje)

Import = Importuoti
Export = Eksportuoti
Reset Messages = Perkrauti Žinutes

Global Caption = Globalus Pavadinimas
Debugger found = Derintojas aptiktas
Monitor software found = Aptikta stebėjimo programa
Cracking tool found = Aptiktas laužymo įrankis
File corrupted = Bylą pažeista
(Not displayed in this version) = (nerodoma šioje versijoje) 
Internal exception occured =  Ištiko vidinė išimties situacija
Virtual Machine Detected = Aptikta virtuali mašina


Enable CodeReplace Technology = Įjungti CodeReplace technologiją
Functions to remove using the CodeReplace Technology: = Panaikinti funkcijas, naudojant CodeReplace technologiją:
Assembly code inside function: = Asemblerinis kodas funkcijos viduje:
Force simulation before protection = Vykdyti simuliaciją prieš pradedant apsaugojimo veiksmus
Run with parameters = Vykdyti su parametrais
Start Simulation = Pradėti simuliaciją

Virtual API-Wrapper = Virtuali API-sąsajos apgaubas
Imported DLLs: = Importuotos DLL bylos:
Functions to Virtualize: = Virtualizuoti funkcijas:
API Virtualization Level: = API-sąsajos virtualizavimo lygis: 
Processor Specifications = Procesoriaus Specifikacijos
Processor Type: = Procesoriaus Tipas
Multiprocessor: = Multiprocesorius
Opcode Type: = Opkodo Tipas:
Dynamic Opcode: = Dinaminis Opkodas:
VM Complexity: = VM Kompleksiškumas:
VM size (aprox): = VM dydis (apytiksliai):
Execution Speed: = Vykdymo greitis:
Entry Point Virtualization = Įėjimo taško virtualizavimas
Multi Branch Technology = Multi Linijinė technologija

Mutable CISC processor = Nepastovus CISC procesorius
Mutable RISC-64 processor = Nepastovus RISC-64 procesorius
Mutable RISC-128 processor = Nepastovus RISC-128 procesorius
Mutable CISC-2 processor = Nepastovus CISC-2 procesorius

Static opcodes = Statiniai opkodai
Metamorphic - Level 1 = Metamorfinis - lygis 1
Metamorphic - Level 2 = Metamorfinis - lygis 2
Metamorphic - Level 3 = Metamorfinis - lygis 3

Disabled = Išjungta
20% Dynamic = 20% Dinaminis
40% Dynamic = 40% Dinaminis
60% Dynamic = 60% Dinaminis
80% Dynamic = 80% Dinaminis

Enable XBundler = Įjungti XBundler
Make files visible to OpenDialog = Bylas padaryti matomas bylų atvėrimo dialoge
Allow bundling from any directory = Leisti pririšti iš bet kurio aplanko
AVI files support = AVI bylų palaikymas
Deleted extracted on exit = Baigiant darbą pašalinti išpakuotas bylas 
Files to bundle: (drag files here) = Pririšti bylas: (atitempkite bylas čia)
XBundler Options = XBundler nustatymai
Add File = Pridėti bylą
Delete File = Ištrinti bylą

Filename = Bylos pavadinimas
Write to disk? = Įrašyti į diską?
Extraction Path (if written to disk) = Išskleidimo kelias (rašant į diską)


Encrypt Application = Užkoduoti Aplikaciją
Protect as DLL Plugin = Apsaugoti, naudojant DLL papildinį
Protect DLL plugin = Apsaugoti DLL papildinį
Last Section Name = Paskutinės sekcijos pavadinimas
.NET assemblies = .NET montažai
Active Context = Aktyvus Kontekstas
Enable support = Įjungti palaikymą
Splash screen settings = Demonstracinio ekrano nuostatos
Mouse Click to proceed = Norint tęsti, spustelkite pelę
Display during a number of seconds = Rodyti tam tikrą sekundžių skaičių

This option will encrypt your protected application. You should never uncheck this option, only for debug purposes. = Ši opcija užkoduos Jūsų apsaugotą aplikaciją. Niekada nereiktų išjungti šios opcijos, nebent tai būtų daroma derinimo tikslais.

Check this option only if your protected DLL will be used as plugin in third party software. = Pažymėkite šią opciją tik tada, jei Jūsų apsaugota dinaminė biblioteka bus naudojama, kaip svetimos aplikacijos papildinys.

You can change the name of the last section added by Themida = Jūs galite pakeisti paskutinės sekcijos pavadinimą, kurią pridėjo Themida

This option should always be enabled to protect your .NET assemblies = Ši opcija turėtų būti visada pažymėta tam, kad apsaugotų jūsų .NET montažus

Support for Active Context based DLLs =  Aktyvaus konteksto dinaminių bibliotekų palaikymas

Select a BMP-8 image that will be displayed when your application is launched = Pasirinkite BMP-8 paveikslėlį, kuris bus rodomas pasileidus aplikacijai

The user must click in the Splash Screen to continue running the protected application = Vartotojas privalo spragtelti ant demonstracinio paveikslėlio tam kad, galėtų toliau dirbti su apsaugota aplikacija

The splash screen will be displayed for a custom number of seconds before continue running the protected application = Demonstracinis paveikslėlis bus rodomas nustatytą sekundžių tarpą prieš pradedant dirbti su apsaugota aplikacija

This option will enable Trial and Licensing protections in Ring-0, which will enhance the way that trial information is stored in the system. If you check this option, a device driver will be embedded and extracted automatically when your application runs. Notice that the Hardware ID is different if you enable or disable this option. = Ši opcija įjungs bandomosios versijos ir licenzijos apsaugą Ring-0 zonoje, tai sustiprins bandomosios versijos informacijos saugojimą sistemoje. Jei pažymėsite šią opciją, bus pridedama įrenginio tvarkylė ir vykdymo metu bus automatiškai išpakuojama. Pastaba, aparatūros identifikacija skirsis jei opcija bus įjungta ar išjungta. 


Reading SDK Macros = Nuskaitomos SDK makro komandos
Redirecting and Encrypting SDK Macros = Nuskaitomos ir užkoduojamos SDK makro komandos
Merging sections / Preparing PE Header = Apjungiamos sekcijos / ruošiamos PE antraštės
Examining and Wrapping API Calls = Peržiūrimi ir apgaubiami API-sąsajos šaukiniai
Generating Unique SecureEngine Code = Generuojamas Unikalus SecureEngine kodas
Linking SecureEngine Code with Application = Susiejamas SecureEngine kodas su aplikacija
Generating Unique Virtual Machine = Generuojama Unikali Virtuali Mašina
Compressing Virtual Machine = Kompresuojama Virtuali Mašina
Virtualizing VM / CodeReplace Macros = Virtualizuojama VM / CodeReplace makro komandos
Compressing Application and Resources = Kompresuojama aplikacija ir resursai
Encrypting Application and Resources = Užkoduojama aplikacija ir resursai

Test Protected File = Testuoti apsaugotą bylą
Protect = Apsaugoti
Cancel = Nutraukti
Play sound when protection finishes = Sugroti, kai bus baigtas apsaugojimas

This option supervises at any time if your application is running under any kind of debugger. = Ši opcija visada stebės ar aplikacija vykdoma kartu su kokiu nors derintoju.
This option avoids your application from being dumped from memory to disk even using the most advanced memory dumping tools = Ši opcija apsaugos nuo bet kokio bandymo nuskaityti atminties turinį ir išsaugoti diske, net jei bus naudojami pažangūs atminties nuskaitimo metodai
This option removes and encrypts the entry point of your application, executing it from a secure place in memory = Ši opcija ištrina ir užkoduoja aplikacijos įėjimo tašką saugioje atminties vietoje
This option will keep your application resources fully encrypted against modifications = Ši opcija apsaugo ir pilnai užkoduoja aplikacijos resursus nuo modifikacijų
If you want that your application will run inside VMWare/VirtualPC you must check this option = Ši opcija turi būti pažymėta jei norit, kad aplikacija veiktų VMWare/VirtualPC aplinkoje
This option will wrap the APIs used in your application to avoid a possible reconstruction of your original application = Ši opcija apgaubia aplikacijoje naudojama API-sąsają tam, kad būtų išvengta originali aplikacijos rekonstrukcija
This option detects if any modification is done to your protected application, either by a cracker or a virus = Ši opcija aptinka ar nebuvo kaip nors modifikuota apsaugota aplikacija, tiek viruso ar piktybiško vartotojo 
This option will activate the internal Metamorph engine to generate multiples opcode mutations for a single block of code = Ši opcija aktyvuoja vidinį metamorfinį variklį, kuris generuoja vienam kodo blokui sudėtines opkodų mutacijas 
This option will protect your application against memory patching = Ši opcija apsaugo aplikaciją nuo galimų atminties koregavimų
This option allows you to choose the desired option to perform when a debugger or cracking tool has been found in memory = Ši opcija leidžia pasirinkti pageidaujama veiksmą, kuris bus atliekamas, jei bus aptiktas derintojas ar laužymo įrankis atmintyje 
This option keeps your application code compressed meanwhile it is not executed = Ši opcija laiko aplikacijos kodą suspaustą, kol aplikacija nėra vykdoma 
This option keeps the resources in your application fully compressed = Ši opcija laiko aplikacijos resursus pilnai suspaustus
This option will compress the SecureEngine code that is appended into your protected application = Ši opcija suspaus SecureEngine kodą, kuris bus pridėtas prie apsaugotos aplikacijos
This option will detect/fool possible files monitors when your protected application is running = Ši opcija aptiks/klaidins bylų stebėtojus, kol bus vykdoma apsaugota aplikacija
This option will detect/fool possible registry monitors when your protected application is running = Ši opcija aptiks/klaidins galimus registrų stebėtojus, kol bus vykdoma apsaugota aplikacija
This option will protect your Delphi/BCB forms against reconstruction from memory. Note that this option is incompatible with some Delphi/BCB applications = Ši opcija apsaugos Delphi/BCB formas nuo galimų rekonstrukcijų atmintyje. Pastaba ši opcija yra nesuderinama su kai kuriomis Delphi/BCB aplikacijomis
Load your customized messages from a file = Nuskaityti bylą su pritaikytomis žinutėmis 
Save your customized messages to a file = Išsaugoti pritaikytas žinutes byloje
This list displays all the DLLs imported by your application = Šis sąrašas parodo visas aplikacijos importuojamas DLL bylas
This list displays all the imported functions for the selected DLL. You can select which functions will be "virtualized" = Šis sąrašas parodo visas importuojamas funkcijas iš pažymėtos DLL bylos. Galite nurodyti, kuri funkcija bus "virtualizuota"
You can import API names from a text file. The imported APIs will be virtualized in the current project = Jūs galite importuoti API-sąsajos vardus iš tekstinės bylos. Importuota API-sąsaja bus virtualizuojama dabartiniame projekte
Select the maximun number of instructions to virtualize from your application entry point = Pasirinkite virtualizacijos maksimalų numerį instrukcijų nuo aplikacijos įeities taško
This option will insert multiple conditional branch instructions inside your unique Virtual Machine, making it harder to analyze = Ši opcija padidina instrukcijų sąlygos atšakas unikalioje virtualioje mašinoje, tai pasunkina programos analizavimą
You can save the current selected APIs into a text file to be imported by another project = Galite išsaugoti dabar pažymėtas API-sąsajas tekstinėje byloje tam, kad vėliau galėtumėte importuoti kitame projekte 
Complexity level to emulate each wrapped API = Kiekvienos API-sąsajos apgaubties emuliavimo kompleksiškumo lygis

Changes have been made. Do you want to save project? = Buvo atlikti pakeitimai. Ar norite išsaugoti projektą?
Save Changes = Išsaugoti pakeitimus

*UNSAVED* = *NEIŠSAUGOTA*
Invalid Project File. Please, recreate a new one = Neteisinga projekto byla. Sukurkite naują
Load Project = Užkrauti projektą
You need XBundler .NET for your .NET application. Please contact info@oreans.com = .NET aplikacijoms privalote įdiegti XBundler .NET. Prašome susisiekti su info@oreans.com
Sorry, Themida Standard cannot protect .NET files. You need to upgrade to Themida Professional for .NET support. Upgrade now? = Atsiprašome, Themida Standard negali apsaugoti .NET bylų. Jums reikia patobulinti į Themida Professional su .NET palaikymu. Ar norite atlikti tai dabar?
Save Project = Išsaugoti projektą
Save Project As... = Išsaugoti projektą kaip...
No file selected. Please select a file to protect (Input Filename) = Nebuvo pasirinkta byla. Pasirinkite bylą, kurią norėtumėt apsaugoti (įvesties byla) 
No Output file selected. Please select an Output file before protecting = Nebuvo pasirinkta išeities byla. Prieš pradedant apsaugojimo veiksmus, pasirinkite išeities bylą
File does not exists: = Byla neegzistuoja:
File is already protected/compressed: = Byla jau apsaugota/suspausta:
File has invalid macros insertion: = Byla turi neteisingus makro komandų įterpimus:
Please, review your macros again = Prašau, dar kartą peržvelkite makro komandas
File cannot be accessed for protection: = Nepavyko atverti bylos apsaugojimui:
Please select a new file to protect (Input Filename) = Pasirinkite naują bylą, kurią norėtumėt apsaugot (įvesties bylą)
File has not being simulated. Please simulate the file before protection or uncheck the "Force simulation before protecting" checkbox = Nebuvo atlikta bylos simuliuota. Prašom, atlikite simuliaciją prieš pradedant bylos apsaugojimo veiksmus arba panaikinkite žymėjimą ties "Vykdyti simuliaciją prieš pradedant apsaugojimo veiksmus"
Open Input File = Atverti įvesties bylą
The resources section in your application is empty. Themida needs to rebuild your application header. Proceed? = Jūsų aplikacijos resursų sekcija yra tuščia. Themida'ai reikalinga aprašo rekonstrukcija. Tęsti? 
Rebuild Header = Rekonstruoti aprašą
File is compressed or already protected: = Bylą suspausta arba jau apsaugota:
Your application seems to be in use or running in memory. Please, make sure to close it before proceeding = Gali būti, kad Jūsų aplikacija šiuo metu yra atverta ar užkrauta atmintyje ir vykdoma. Prašau patikrinkite ar aplikacija nėra vykdoma prieš pradėdami apsaugojimo veiksmus
Error = Klaida
Your application header is incompatible with Themida. Do you want Themida to rebuild your application header? = Jūsų aplikacijos antraštė nesuderinama su Themida. Ar norite, kad Themida rekonstruotų aplikacijos aprašą?
.NET limitation = .NET apribojimai
Sorry, you cannot change the global message caption in demo version = Atsiprašom, bet Jūs negalite pakeisti globalios žinutės antraštės demo versijoje
Warning! The current CodeReplace macros are not valid for the selected file. CodeReplace macros removed = Įspėjimas! Einamosios CodeReplace makro komandos nėra veiksmingos pasirinktai bylai. CodeReplace makrosai buvo pašalinti
Warning = Įspėjimas
Warning! The current application is already protected/compressed. Do you still want to protect it? = Įspėjimas! Einamoji aplikacija jau yra apsaugota/suspausta. Ar vis tiek norite apsaugoti?
File has a missing macro START or END: = Bylai trūksta makro komandų START ir END:
Please review your macros again = Prašau peržiūrėkite makro komandas dar kartą
File cannot be opened: = Byla negali būti atverta:
Make sure that other application is not using it = Patikrinkite ar kitos programos nenaudoja
File to protect has an invalid PE header. Unable to inspect file = Saugomoji byla turi netaisyklingą PE aprašą. Nepavyko išnagrynėti bylos
File to protect contains one macro with few lines of code on it. Please review your macros again = Saugoma byla turi vieną makro komandą su keliomis kodo eilutėmis. Prašau, peržiūrėkite dar kartą makrosus
Sorry, the current version of Themida does not support CodeReplace in Visual Basic Pcode applications = Atsiprašome, bet esamoji Themida versija nepalaiko CodeReplace Visaul Basic Pcode aplikacijose
Sorry, the current version of Themida does not support CodeReplace in .NET applications = Atsiprašome, bet esamoji Themida versija nepalaiko CodeReplace .NET aplikacijose
Unable to find a function to add CodeReplace technology = Nepavyksta aptikti funkcijos tam, kad būtų pridėta CodeRepalce technologija
Run with parameters = Vykdyti su parametrais
Please enter the parameters = Prašome, įveskit parametrus
Sorry, you cant disable that option in demo version = Atsiprašome, bet demo versijoje Jūs negalite išjungti šios opcijos
Messages exported to = Žinutės eksportuotos į
Messages imported from = Žinutės importuotos iš
Themida GUI Overview = Themida GUI apžvalga
Protect Now = Apsaugoti dabar
SecureEngine Technology = SecureEngine technologija
SecureEngine Macros = SecureEngine makrosai
Code Replace = Kodo pakeitimas
Software Updates = Programinės įrangos atnaujinimai
What is XBundler = Kas yra XBundler
Using XBundler = XBundler naudojimas

Scenarios for Using XBundler = XBundler naudojimo scenarijai
*** ERROR: Project file does not exist or invalid. (Exit code 1) *** = *** KLAIDA: Projekto byla neegzistuoja ar yra netaisyklinga. (Pabaigos kodas 1) ***
*** ERROR: File to protect does not exist. (Exit code 2) *** = *** KLAIDA: Apsaugojimo byla neegzistuoja. (Pabaigos kodas 2) ***
*** ERROR: File is already protected. (Exit code 3) *** = *** Klaida: Byla jau apsaugota (Pabaigos kodas 3) ***
*** ERROR: Error in SecureEngine macros. Please review them again. (Exit code 4) *** = *** KLAIDA: Aptiktos klaidos SecureEngine makro komanduose. Peržvelkite jas dar kartą (Pabaigos kodas 4) ***
*** ERROR: File to protect cannot be opened. (Exit code 2) *** = *** KLAIDA: Nepavyko atverti saugomos bylos. (Pabaigos kodas 2) ***
*** ERROR: The splash file seems do not have 256 colors. Only 256 BMP files will be displayed correctly. = *** KLAIDA: Demonstracinis paveikslėlis neturi 256 spalvų. Tik BMP paveikslėliai su 256 spalvomis yra rodomi korektiškai.
*** ERROR: The splash file seems to be a BMP compressed. Only non compressed BMP files will be displayed correctly. = *** KLAIDA: Demonstracinis paveikslėlis yra suspaustas. Tik nesuspausti BMP paveikslėliai yra rodomi korektiškai.
Macros found: = Makro komandos aptiktos:
*** Fatal error while protecting file. (Exit Code 5) *** = *** Įvyko lemtinga klaida bandant apsaugoti bylą. (Pabaigos kodas 5) ***
*** ERROR: Cannot write protected file. Make sure the file is not in use. (Exit code 6) *** = *** KLAIDA: Nepavyko įrašyti apsaugotos bylos. Patikrinkite ar byla nėra dabar naudojama. (Pabaigos kodas 6) ***
Generating Unique SecureEngine Code... = Generuojamas unikalus SecureEngine kodas...
Linking SecureEngine Code with Application... = Susiejamas SecureEngine kodas su aplikacija...
done. = baigta.
Encrypting Application and Resources... = Užkoduojama aplikacija ir resursai...
Compressing Application and Resources... = Suspaudžiama Aplikacija ir Resursai...
Macros processed: = Makrosai apdoroti:

processed: = apdorota:
Application successfully protected. = Aplikacija buvo sėkmingai apsaugota.
Do you want to go to the order form Themida subscription plans? = Ar norite aplankyti Themidos prenumeravimo planų užsakymo formą?
No file selected. Please, select a file to protect (Input Filename) = Nepasirinkta nei viena byla. Prašau pasirinkite bylą, kurią norite apsaugoti (įvesties bylą)
Question = Klausimas
-- Files to Bundle -- = -- Pridėti bylas --
The path of the file that you are inserting must be relative to: = Bylos kelias, kurią norite pridėti turi būti reletyvus į:
All imported by ordinal! = Viskas buvo importuota iš eilės!
Medium = Vidutinis
Normal = Normalus
High = Aukštas
Supreme = Aukščiausias
Extreme = Ekstremalus
Highest = Aukštasis

This option is not enabled in DEMO version = Ši opcija neįjungta DEMO versijoje
DEMO Restriction = DEMO apribojimai
The splash file seems do not have 256 colors. Only 256 BMP files will be displayed correctly. = Demonstracinis paveikslėlis neturi 256 spalvų. Tik BMP piešinėliai su 256 spalvomis yra rodomi korektiškai. 
The splash file seems to be a BMP compressed. Only non compressed BMP files will be displayed correctly. = Demonstracinis paveikslėlis yra suspaustas. Tik nesuspausti BMP paveikslėliai yra rodomi korektiškai
Sorry, Themida DEMO does not support RISC-128 processors = Atsiprašome, tačiau Themida DEMO nepalaiko RISC-128 procesoriaus
Processor Type = Procesoriaus Tipas
Sorry, Themida DEMO does not support Dynamic Opcodes = Atsiprašome, tačiau Themida DEMO nepalaiko dinaminių opkodų
The file is never extracted to disk! = Byla niekada nėra išpakuojama diske! 
Select file/s to bundle = Pasirinkite bylą /-as, kurios bus prikabinamos
No file selected. Please, select a file to protect (Input Filename) = Nepasirinkta nei viena byla. Prašau pasirinkite bylą, kurią norite apsaugoti (Įvesties bylą)
Last Modified: = Paskutinį kartą modifikuota:
(Application header has been rebuilt by Themida) = (Aplikacijos antraštė buvo modifikuota Themidos) 
File Type: Windows Standard Executable = Bylos tipas: Windows Standard Executable
File Type: Visual Basic Native Executable = Bylos tipas: Visual Basic Native Executable
File Type: Visual Basic PCode Executable = Bylos tipas: Visual Basic PCode Executable
File Type: Windows .NET Executable = Bylos tipas: Windows .NET Executable
File Type: MACROMEDIA Executable = Bylos tipas: MACROMEDIA Executable
File Type: PowerBuilder Application = Bylos tipas: PowerBuilder Application
File Type: Excelsior JET Application = Bylos tipas: Excelsior JET Application
File Type: Dynamic Link Library (DLL) = Bylos tipas: Dinaminė biblioteka (DLL)
File Type: OLE Control Extension (OCX) File = Bylos tipas: OLE Control Extension (OCX) Byla
File Type: Screensaver File = Bylos tipas: Ekrano užsklanda
File Type: Windows NT Service = Bylos tipas: Windows NT servisas
File Type: Borland Library = Bylos tipas: Borland biblioteka
File Type: Linux Executable (ELF/i386) = Bylos tipas: Linux Executable (ELF/i386)
File Type: NT Device Driver = Bylos tipas: NT įrenginio tvarkyklė

*** Protected with Code Virtualizer *** = *** Apsaugota su kodo vizualizatoriumi ***
Virtual Machine Macro Functions: = Virtualios mašinos Makro Funkcijos:
CodeReplace Macro Functions: = CodeReplace Makro Funkcijos:
CodeEncrypt Macro Functions: = CodeEncrypt Makro Funkcijos:
ClearCode Macro Functions: = ClearCode Makro Funkcijos:
Registered Macro Functions: = Registruotos makro Funkcijos:
Unregistered Macro Functions: = Neregistruotos Makro Funkcijos: 
Read functions automatically = Nuskaityti funkcijas automatiškai
Read functions from SDK = Nuskaityti funkcijas iš SDK
File already protected/compressed. = Byla jau apsaugota/suspausta
Error: There is a missing START or END in one of your macros. = Klaida: Neaptikta START ar END komanda, viename iš Jūsų makro kode.
Error: Unable to open the selected file. File may be in use. = Klaida: Nepavyko atverti pasirinktos bylos. Byla šiuo metu gali būti naudojama.
Error: Invalid PE header in selected file. = Klaida: Pasirinktoje byloje netaisyklinga PE antraštė. 
Error: The included code inside a macro is too small. = Klaida: Į makrosą įterptas kodas yra per mažas.
Error: There are at least a nested VM macros. VM macros cannot be nested. = Klaida: Yra perpintas kodas VM makrose. VM makrosai negali būti perpinti.
Error: The selected file is not an x64 application. You need Themida x32 to protect that application. = Klaida. Pasirinkta byla nera x86 aplikacija. Jums reikia Themida x32, kad galėtumėte apsaugoti šią aplikaciją.
Error: The selected file is an x64 application. You need Themida x64 Edition to protect that application. = Klaida: Pasirinkta byla yra x64 aplikacija. Jums reikia Themida x64 Edition, tam kad būtų apsaugota ši aplikacija. 
Project: = Projektas:
Select functions from MAP file = Pasirinkite funkcijas iš MAP bylos
Read functions automatically = Nuskaityti funkcijas automatiškai
How many functions do you want to add? = Kiek funkcijų norėtumėt pridėti?
OK = Gerai
Sorry, the required MAP file was not found. Please, generate a MAP file for your application = Atsiprašome, bet reikalinga MAP byla nerasta. Prašome sugeneruoti aplikacijai MAP bylą 
There are not functions to simulate. Please, insert some functions either manually or automatically = Nėra funkcijų, kurias būtų galima simuliuoti. Prašom, įterpkite keletą funkcijų rankiniu ar automatiniu būdu
Simulator = Simuliatorius
Information = Informacija
None = Nėra
Message = Žinutė
Customize Dialog = Individualizuoti dialogą
Close = Uždaryti

Internal Protection Messages = Vidinės apsaugos žinutės
Trial/Registration Messages = Bandomosios/Registracijos žinutės
Will be displayed by WinLicense = Bus rodoma WinLicenzijos
Displayed by SDK or not displayed = Bus rodoma SDK arba nerodoma
Cannot update oreans.sys driver (admin rights) = Nepavyko atnaujinti oreans.sys tvarkyklės (administratoriaus teisės)
Cannot open oreans.vxd driver (already in use) = Nepavyko atverti oreans.vxd tvarkyklės (šiuo metu naudojama)
Driver cannot be updated = Nepavyko atnaujinti tvarkyklės
Computer needs to be reset to install driver = Tam, kad būtų idiegtos tvarkyklės, kompiuteris turi būti perkrautas
Cannot write oreans.vxd (already in use) = Nepavyko įrašyt oreans.vxd (šiuo metu naudojama)

Trial nag screen (reminder) = Bandomosios versijos kabinėjimasis (priminimas)
Trial days expired = Baigėsi bandymo dienos
Trial executions expired = Baigėsi bandomieji vykdymai
Trial date expired = Baigėsi bandymo data
Trial runtime expired = Baigėsi vykdymo laikas
Trial global time expired = Baigėsi globalus bandymo laikas
Trial locked to different country = Bandymas fiksuotas prie kitos valstybės 
Trial extension key corrupted = Bandymo išplėtimo raktas pažeistas
No more trial extensions allowed = Daugiau nebegalimi jokie bandymo praplėtimai
Show registration info (only first time when registered) = Rodyti registracijos informaciją (tik pirmą karta užsiregistravus)
License days expired = Baigėsi licenzijos dienos
License executions expired = Baigėsi licenzijos vykdymo laikas
License date expired = Baigėsi licenzijos data
License global time expired = Baigėsi globalus licenzijos laikas
License key corrupted = Pažeistas licenzijos raktas
License locked to different machine = Licenzija fiksuota prie kitos mašinos
License without machine locking = Licenzija be mašinos prirakinimo
No more hardware changes allowed = Nebegalimi jokie aparatinės dalies pakeitimai
Stolen license key = Pavogtas licenzijos raktas
License is not expirable = Licenzija niekada nesibaigia
License required to run = Tam, kad būtų vykdoma, reikalinga licenzija
Trial/Licensing Manager manipulated = Buvo atliktos licenzijos/bandymo valdytojo manipuliacijos
Invalid user/password (for password dialog) = Neteisingas vartotojo vardas ar slaptažodis (slaptažodžio dialogui) 

This application(s) will run in trial/restricted mode, until registered. = Kol nebus užregistruota, ši aplikacija veiks bandymo/apribotam režime
Days Expiration = Galiojimo dienų pasibaigimas
Date Expiration = Galiojimo datos pasibaigimas
Executions = Įvykdymai
Run Time (execution) = Vykdymo laikas (įvykdimas)
Global Time = Globalus laikas
days = dienos
times = kartai
minutes = minutės
Unlimited = Neribotas
(For custom restrictions) = (dėl individualių apribojimų)
Trial Restrictions = Bandymo apribojimai
Clock Change = Laiko pakeitimas
Trial Extension = Bandymo išplėtimai
Lock trial to user language = Fiksuoti bandomają prie vartotojo kalbos
Allow trial period to be extended (with a valid key) = Leisti praplėsti bandymo periodą (su teisingu raktu)
Extension Key distribution options = Praplėtimo rakto išplatinimo opcijos
With single file = Su bendra byla
With Registry = Su registrais
Value Name = Reikšmės vardas
Maximum Extensions = Maksimalūs praplėtimai
Maximum extensions allowed = Maksimalūs leidžiami praplėtimai

This option sets a trial period to a certain amount of days since the application is started for the first time = Ši nuostata leidžia nustatyti bandomosios versijos periodą tam tikram dienų skaičiui. Dienos skaičiuojamos nuo tada, kai aplikacija buvo paleista pirmą kartą 
This option sets an exact date for the end of the trial period = Ši nuostata leidžia nustatyti tikslią datą, kada pasibaigs bandomosios versijos galiojimo laikas
This option sets an exact number of executions allowed for an application = Ši nuostata leidžia nustatyti kiek kartų bus galima įvykdyti aplikaciją
This option sets an exact amount of time (in minutes) that an application can stay in memory = Ši nuostata leidžia nustatyti kiek laiko (minutėmis) aplikacija gali būti laikoma atmintyje
This option sets an exact amount of total time (in minutes) that an application can run during all Windows® sessions = Ši nuostata leidžia nustatyti kiek laiko (minutėmis) aplikacija galės būti vykdoma visose Windows® sesijose
This option allows an application to run in trial mode without any restrictions added by WinLicense = Ši nuostata leidžia aplikacijai veikti bandymo režime be jokių apribojimų, kuriuos pridėjo WinLicense
You can select how sensitive WinLicense will behave against clock changes. If for example, you select "1 day clock back", WinLicense will ignore if the clock has been turned back for 1 day. = Jūs galite pasirinkti kaip jautriai WinLicense reaguos į laikrodžio pakeitimus. Pavyzdžiui, Jūs galite pasirinkti "1 dieną atgal", kad WinLicense ignoruos, jei laikrodis bus 1 dieną atsuktas atgal.
This option allows an application to be locked to specific country when it runs in trial mode = Ši nuostata leidžia pririšti aplikaciją prie tam tikros šalies, kol aplikacija veiks bandomajam režime
This option allows you to extend the trial period of your application with special trial extension keys = Ši nuostata leidžia praplėsti aplikacijos bandomojo periodo laiką su specialiu bandymo praplėtimo raktu
This option sets the name of a trial extension file to be searched by WinLicense when the application is being started = Ši nuostata nustato bandomosios versijos praplėtimo bylos vardą, kurio ieškos WinLicense, kai aplikacija bus paleista. 
This option is used to allow distribution of extension keys as Windows® Registry key files = Ši nuostata naudojama, kai norima leisti platinti praplėtimo raktus, kaip Windows® Registrų raktų failus
This option limits the amount of trial extensions that an application can be extended = Ši nuostata apriboja kiek kartų bus galima praplėsti aplikacijos bandomąją versiją


Any clock change = Bet koks laikrodžio keitimas
1 hour clock back = 1 valandą atgal
1 day clock back = 1 dieną atgal

This application(s) can be registered, with the presence of a valid key. = Šią aplikaciją (-as) bus galima užregistruoti su egzistuojančiu teisingu raktu.
License Keys Accepted = Licenzijos raktai priimti
Types of accepted License Keys = Priimtų licenzijos raktų tipai
Single file = Viena byla
Registry = Registras
Security Options = Saugumo nuostatos
Enable SmartActivate® System for user-side generated keys. = Įjungti vartotojo pusėje sugeneruotiems raktams SmartActivate® sistemą.
Allow only hardware dependent (locked) registrations. = Leisti tik registraciją, kuri yra surišta su aparatūrine dalimi.
Accept only temporary keys (that expire). = priimti tik laikinus raktus (kurių galiojimas baigsis).
Application only runs when registered. (Requires a key to run) = Aplikacija veiks tik užregistruota. (Reikalingas raktas tam, kad pasileistų)
Clear trial info when registered. = Užregistravus aplikaciją, išvalyti bandomosios versijos informaciją.
License Key Signature = Licenzijos rakto parašas
Level 1 = 1 Lygis
Level 2 = 2 Lygis
For professional and elegant licensing control, WinLicense offers the SmartActivate® System. This technology allows an application to be registered using SmartActivate® keys = Profesionaliam ir elegantiškam licenzijavimo kontroliavimui, WinLicense siūlo SmartActivate® sistemą. Ši technologija leidžia registruoti aplikaciją, naudojant SmartActivate® raktus
This option restricts the use of registration keys to a specific computer. As each computer has an unique machine ID (processor type, hard disk and BIOS serial), WinLicense can lock a registration key to that specific machine = Ši nuostata apriboja registracijos raktus tik specifiniam kompiuteriui. Kiekvienas kompiuteris turi unikalų mašinos identifikatorių (procesorius, kietasis diskas ir BIOS serijos numeris), WinLicesne gali surišti registracijos raktus su šiais duomenimis
This option denies the use of "time unlimited" registration keys and forces WinLicense to accept only temporary registration keys = Ši nuostata panaikina neriboto naudojimo registracijos raktus ir WinLicense priimta tik laikino naudojimo raktus
This option allows user to run an application only in the presence of a valid registration key. WinLicense will terminate the application if no key is found or if it is invalid = Ši nuostata leidžia vartotojui naudoti aplikaciją tik tuo atvėju, jei yra įdiegtas teisingas registracijos raktas. Priešingu atvėju WinLicense nutrauks aplikacijos darbą
The purpose of this option is to clear the trial information from a computer once an user receives a valid registration key and registers an application. If the user decides to remove the registration key or it expires, the trial period will restart from zero = Šios opcijos tikslas yra išvalyti bandomosios versijos informaciją iš kompiuterio, kai tik vartotojas gauna teisingą registracijos raktą su kuria užregistruoja aplikaciją. Jei vartotojas nusprendžia išvalyti registracijos raktą arba registracijos rakto galiojimo laikas pasibaigia, bandomasis laikotarpis bus skaičiuojamas nuo 0
This option allows you to select the signature level used by WinLicense to check that licenses for your applications are genuine = Ši nuostata leidžia pasirinkti signatūros lygį, kurį naudos WinLicense tikrinant licenzijos, skirtos jūsų aplikacijai, autentiškumą

Enable Password Protection = Įjungti apsaugą su slaptažodžiu
Password requirement = Slaptažodžio reikalavimai
Password Action = Slaptažodžio veiksmai
Encrypt EXE using the password hash. = Užkoduoti EXE bylą naudojant slaptažodžio maišos (hash) reikšmę.
On Normal / Trial Version = Normalioje / Bandomojoje Versijoje
On Registered Version = Registruotoje versijoje
Never ask for a password. = Niekada neklausti slaptažodžio.
I will ask for a password manually. = Slaptažodžio paklausiu rankiniu būdu.
Automatically, ask for a password only the first time. = Automatiškai klausti slaptažodžio tik pirma kartą paleidus.
Automatically, always ask for a password. = Visada automatiškai reikalauti slaptažodžio.

Hardware Lock = Aparatinės dalies pririšimas
Custom Hardware Items = Sudėtiniai aparatinės dalies elementai
Hardware Items = Aparatinės dalies elementai
All hardware items = Visi aparatinės dalies elementai
CPU = CPU
BIOS =  BIOS
MAC Address = MAC adresas
HDD Serial = HDD serijos numeris
Allowed CPU changes = Galimi CPU pakeitimai
Allowed BIOS changes = Galimi BIOS pakeitimai
Allowed NIC changes = Galimi NIC pakeitimai
Splash settings = Demonstracinio paveikslėlio nuostatos

Keep Trial Running = Nenutraukti bandomosios versijos vykdymo
Keep running = Nenutraukti vykdymo
Launch Application when Trial Expired = Paleisti aplikaciją, kai bandomoji versija pasibaigs
Launch Application = Paleisti aplikaciją
Application Name: = Aplikacijos Vardas:
Enable Custom Event = Įjungti individualius įvykius
Export Specific Generators = Eksportuoti Specifinius Generatorius
Event Name: = Įvykio Vardas
Export Generators = Eksportuoti Generatorius
Custom Event = Individualizuotas įvykis
This option will export a specific license generator when your application is being protected = Ši nuostata eksportuos specifinį licenzijos generatorių, kai aplikacija bus paleista
This option will run an external application when the trial period in your application has expired. = Ši nuostata paleis išorinę aplikaciją, kai bandomasis aplikacijos periodas pasibaigs.
You can define a custom event to exclude the initialization of several protected applications at the same time. This option is also suitable when your application is launched many times per minute. =  Jūs galite nustatyti individualų įvykį, kuris bus neitrauktas į skirtingų aplikacijų initializaciją, vykdant tuo pačiu metu. Ši nuostata taip pat tinkama, kai aplikacija yra paleidžiama daug kartų per minutę. 
Check this option if you want that your application continues running in trial mode if an invalid license key is present. =  Pažymekite šią nuostatą, jei norite, kad aplikacijos darbas būtų nenutrauktas net ir tuo atveju, jei neteisingas licenzijos raktas yra įdiegtas.
*** Demo Version *** = *** Demo Versija ***
Destroy Exports section = Sunaikiti eksportų sekciją
This option will destroy the export table of your DLL control for maximum security = Tam, kad būtų pasiektas maksimalus saugumas ši nuostata sunaikina jūsų dinaminės bibliotekos (DLL) eksportų lentelę
Select specific functions from your DLL to handle each event = Pasirinkite iš dinaminės bibliotekos (DLL) specifines funkcijas, kurios apdoros kiekvieną įvykį 
DLL Control file = DLL Control byla

Export specific generators to App. folder = Eksportuoti specifinius generatorius į Ap. aplanką
Trial in debug mode (for testing purposes) = Laikinoji versija derinimo režime (tik testavimo tikslais)
Check this option if you want to create a custom license generator for your protected application. The generator will be created in a subfolder inside your application folder. = Pažymėkite šią nuostatą jei norite, kad būtų jūsų aplikacijai sukurtas  individualus licenzijų generatorius. Generatorius bus sukurtas aplikacijos aplanko poaplankyje.
Uncheck this option only when you are going to release your protected program. For testing purposes, leave this option checked to avoid storing unnecessary information in your system about your trial status. = Panaikinkite žymėjimą tik tuo atvėju, jei ruošiatės išleisti apsaugotą programą. Testavimo tikslais palikite šią nuostatą pažymėtą, kad išvengtumėte nereikalingos informacijos saugojimo sistemoje apie laikinosios versijos statusą.

&Add = Pridėti
&Edit = Redaguoti
&Delete = Trinti
Name = Vardas
Company = Kompanija
Total Customers: = Iš viso klientų:
New Customer = Naujas klientas
Edit Customer = Redaguoti kliento informaciją
Delete Customer = Pašalinti klientą
Customers = Klientai
Extra Details = Papildomos detalės
Add Customer = Pridėti klientą
Update = Atnaujinti
Filename = bylos vardas
Version = Versija
Total Software: = Iš viso programų:
Do you want to delete this software? = Ar norite ištrinti šią programą?
Confirm = Patvirtinti
Add Software = Pridėti Programą
Edit Software = Redaguoti Programą
Delete Software = Ištrinti Programą
Duplicate Software = Dubliuoti Programą
(leave blank to use the same input and output filename) = (Jei norite naudoti tuos pačius įvesties ir išvesties vardus, palikite tuščią lauką)
Input File Type = Įvesties bylos tipas
License Unique Key = Licenzijos unikalus raktas
Trial Unique Key =  Laikinas unikalus raktas
Password Unique Key =  Slaptažodžio unikalus raktas
Windows Standard Executable (EXE) = Windows standartinė vykdomoji byla (EXE)
Dynamic Link Library (DLL) = Dinaminė biblioteka (DLL)
OLE Control Extension (OCX) = OLE valdytojo plėtinys (OCX)
Windows .NET Executable = Windows. NET vykdomoji byla
Windows NT/XP Service = Windows NT/XP Servisas
Screensaver File (SCR) = Ekrano užsklandos byla (SCR)
Copy Software = Kopijuoti programą
Reg Unique Key missing. Please, select one. = Nerastas Reg unikalus raktas. Prašom, pasirinkti.
Software Manager = Programų tvarkytojas
Sofware name missing. Please, select one. = Nerastas programos pavadinimas. Prašom, pasirinkti.
Reg Unique Key is too short. Please, select a new unique key. = Reg unikalus raktas yra per trumpas. Prašome pasirinkti naują unikalų raktą.
Trial Unique Key missing. Please, select one. = Nerastas Laikinasis Unikalus Raktas. Prašom, pasirinkti.
Trial Unique Key is too short. Please, select a new unique key. = Laikinasis Unikalus Raktas per trumpas. Prašom pasirinkti naują unikalų raktą.
Pass Unique Key missing. Please, select one. = Nerastas slaptažodžio Unikalus raktas. Prašom, pasirinkti.
Pass Unique Key is too short. Please, select a new unique key. = Slaptažodžio unikalus raktas per trumpas. Prašome, pasirinkti naują unikalų raktą.
The software already exists in database. Please, choose a new software name or version. = Programa jau egzistuoja duomenų bazėje. Prašome, pasirinkti naują programos vardą ar versiją.
A new License Hash is going to be created. Previous generated licenses will not work if you create a new hash. Proceed? = Nauja licenzijos maiša (Hash) bus sukurta. Jei sugeneruosite naują maišatį (Hash) ankščiau sukurtos licenzijos nebeveiks. Tęsti?
Duplicated Software = Duplikuota programa
File cannot be opened. Make sure the application is not running or being used. = Negalima atverti bylos. Patikrinkite ar aplikacija šiuo metu nėra vykdoma ar naudojama.
Protection Error = Apsaugojimo klaida
Protect Error = Apsaugos klaida
File is compressed or already protected. = Byla yra suspausta arba jau apsaugota.
File has a missing macro START or END. Please correct this error before protecting. = Byloje nerastos makro komandos START ar END. Prašom ištaisyti šias klaidas prieš pradedant apsaugojimo veiksmus.
File cannot be opened. Make sure that other application is not using it. = Nepavyko atidaryti bylos. Patikrinkite ar kita programa šiuo metu nenaudoja šios bylos.
File has an invalid PE header. Unable to protect. = Byla turi neteisingą PE aprašą. Nepavyko apsaugoti.
File contains one macro with few lines of code on it. Please review your macros before protecting. = Byla turi vieną makro komandą su keliomis kodo eilutėmis. Prašau, peržiūrėkite dar kartą makrosus.
File seems to be in use. Please, close the file to proceed with protection. = Panašu, kad byla yra naudojama. Prašau, uždarykite bylą prieš pradėdami apsaugos procesą.
The splash file does not exist. = Demonstracinis piešinėlis neegzistuoja.
Splash = Demonstracinis piešinėlis
The splash file seems do not have 256 colors. Only 256 BMP files will be displayed correctly. = Panašu, kad reklaminis piešinėlis neturi 256 spalvų. Tik BMP piešinėliai su 256 spalvomis yra rodomi korektiškai
The splash file seems to be a BMP compressed. Only non compressed BMP files will be displayed correctly. = Panašu, kad reklaminis piešinėlis yra suspaustas. Tik nesuspausti BMP piešinėliai yra rodomi korektiškai
Do you want to cancel the protection process? = Ar tikrai norite nutraukti šį apsaugojimo procesą?
Cannot open file to protect for writing. Please, make sure that the file is not being used or running. Protection aborted. = Nepavyko atverti rašymui bylos, kuri turi būti apsaugota. Prašau, patikrinkite ar ši byla dabar nėra naudojama kitos programos ar vykdoma. Apsaugojimas nutrauktas. 
Cannot write protected file to disk. Please, make sure you have write permits and enough space in your disc. = Nepavyko išsaugoti apsaugotos bylos diske. Prašau, patikrinkite ar turite atitinkamas rašymo teises ir ar yra pakankamai vietos diske.
Sorry, the DEMO version of WinLicense only allows protection with trial/licensing in debug mode = Atsiprašome, WinLicense DEMO versija leidžia apsaugoti tik su laikinu/licenzijavimu derinimo režime
WinLicense DEMO = WinLicense DEMO

&Add License = Pridėti Licenziją
&Edit License = Redaguoti Licenziją
&Delete License = Trinti Licenziją
Create License Key = Sukurti Licenzijos Raktą
Mark as Stolen = Pažymėti, kaip pavogtą
Unmark Stolen = Panaikinti pavogimo žymę
Stolen = Pavogtas
Ban Hardware IDs = Uždrausti aparatinės dalies ID'us
Please make a selection... = Prašom, pasirinkite...
License Details = Licenzijos Detalės
License Generation = Licenzijos Generavimas
Hardware ID = Aparatinės dalies ID
Custom Data = Individualūs Duomenys
Key Type = Rakto Tipas
Country Locking = Šalies fiksavimas
Store generated Licenses in folder: = Sugeneruotas Licenzijas išsaugoti aplanke:
Generate File Key = Generuoti Bylos Raktą
Generate Registry Key = Generuoti Registro Raktą
Generate Text Key = Generuoti Tekstinį Raktą
Generate SmartActivate Key = Generuoti SmartActivate Raktą

Total Software: = Iš viso programų:
All = Visos
Please make a selection... = Prašome pasirinkti...
Nothing selected. = Nepasirinkta
Selection: = Pasirinkimas:
Software: = Programa
Do you want to mark the current key as stolen? = Ar tikrai norite pažymėti šį raktą, kaip pavogtą?
Stolen Keys = Pavogti Raktai
Do you want to unmark the current key from being stolen? = Ar tikrai norite panaikinti pavogimo žymę šiam raktui?
Do you want to delete this license? = Ar tikrai norite ištrinti šią licenziją?
Warning: The generated keys will have the settings from the current project. Proceed? = Įspėjimas: Sugeneruoti raktai turės šio projekto nustatymus. Tęsti?
Generate License = Generuoti Licenziją
Cannot create directory: = Nepavyko sukurti aplanko:
Please, select which type of license you want to generate = Prašom pasirinkti kokio tipo licenziją norite sugeneruoti 
Keys successfully generated in folder: = Raktai sėkmingai sugeneruoti ir išsaugoti aplanke:
Please, first select a valid application to protect = Prašom pirmą pasirinkite aplikaciją, kurią ruošiatės apsaugoti
Ban Hardware Id = Uždrausti aparatinės dalies Id

License Restrictions = Licenzijos Apribojimai
Customer = Klientas
Software = Programa
Save = Išsaugoti
Edit License = Redaguoti Licenziją
Add License = Pridėti Licenziją
Please, select a customer from database. = Prašom pasirinkti klientą iš duomenų bazės.
License Manager = Licenzijos Valdymas
Please, select a software from database. = Prašome pasirinkti programą iš duomenų bazės.
Please, insert a Hardware ID for verification = Prašom patikrinimui įterpti aparatinės dalies ID
The inserted Hardware ID is valid = Įterptos aparatinės dalies ID yra teisingas
Invalid Hardware ID inserted = Įterptas Aparatinės Dalies ID yra Neteisingas
Another instance of WinLicense is running = Kitas WinLicense egzempliorius jau yra paleistas
You have enabled SmartActivate keys but you have not selected any type of License Keys accepted (Single file or Registry) Remember that you have to use WLRegSmartKeyInstallToFile or WLRegSmartKeyInstallToRegistry to finally install the SmartActivate key = Jūs įjungėte SmartActivate raktus tačiau nepasirinkote ne jokio Licenzijos Raktų tipo (paprasta byla ar Registras). Atsiminkit, kad jūs turėtumėt naudoti WLRegSmartKeyInstallToFile arba WLRegSmartKeyInstallToRegistry, kad pilnai įdiegtumėte SmartActivate raktą
File has not being simulated: = Nebuvo atlikta bylos simuliacija:
Please simulate the file before protection or uncheck the "Force simulation before protecting" checkbox = Prašom, atlikite simuliaciją prieš pradedant bylos apsaugojimo veiksmus arba panaikinkite žymėjimą ties "Vykdyti simuliaciją prieš pradedant apsaugojimo veiksmus"
Warning: Your application has been set up to be registered with a valid license key, but you have not selected any way of registration. If you continue, your application will not be able to be registered. Proceed? = Įspėjimas: Jūs nustatėte, kad aplikacija bus registruojama su galiojančiais licenzijos raktais, tačiau nepasirinkote kokiu būdu bus vykdoma registracija. Jei jūs tęsite, nebus galimybės užregistruoti aplikacijos. Tęsti?
Warning: Your application has been set up to be extended with trial extension key, but you have not selected any way to extend the trial period. If you continue, your application will not be able to be extended. Proceed? = Įspėjimas: Jūs nustatėte, kad aplikacija priimis išplėstinius laikinuosius raktus, tačiau nenustatėte kokiu būdu bus praplėstas laikinasis periodas. Jeigu tęsite, aplikacija neturės galimybės būti pratęsta su laikinaisiais raktais. Tęsti?
Your application header is incompatible with WinLicense. Do you want WinLicense to rebuild your application header? = Jūsų aplikacijos aprašas nėra suderinamas su WinLicense. Ar norite, kad WinLicense rekonstruotų aplikacijos aprašą?
Sorry, WinLicense Standard cannot protect .NET files. You need to upgrade to WinLicense Professional for .NET support. Upgrade now? = Atsiprašome, bet WinLicense Standard nepalaiko .NET bylų apsaugojimo. Norint įdiegti .NET palaikymą, jums reikėtų patobulinti į WinLicense Professional. Ar norite patobulinti dabar?
Note: CodeReplace has been added into your application = Pastaba: CodeReplace buvo pridėta prie jūsų aplikacijos
(Application header has been rebuilt by WinLicense) = (WinLicense rekonstravo aplikacijos aprašą)
Error: The selected file is not an x64 application. You need WinLicense x32 to protect that application. = Klaida: Pasirinkta byla nėra x64 aplikacija. Tam, kad apsaugotumėte šią aplikaciją jums reikia WinLicense x32.
Error: The selected file is an x64 application. You need WinLicense x64 Edition to protect that application. = Klaida: Pasirinkta byla yra x64 aplikacija. Tam, kad apsaugotumėte šią aplikaciją jums reikia WinLicense x64 Edition.
Sorry, the MAP file was not found: = Atsiprašom, bet MAP byla nebuvo rasta:
Please, generate a MAP file for your application = Prašom, sugeneruoti aplikacijai MAP bylą
Sorry, the current version of WinLicense does not support CodeReplace in Visual Basic Pcode applicaitons = Atsiprašom, bet ši WinLicense versija nepalaiko CodeReplace technologijos Visual Basic Pcode aplikacijose
Sorry, the current version of WinLicense does not support CodeReplace in .NET applications = Atsiprašom, bet ši WinLicense versija nepalaiko CodeReplace technologijos .NET aplikacijoms
There are some functions highly executed and some not executed in simulation. Do you want to unselect those functions? = Aptiktos funkcijos, kurios yra labai dažnai vykdomos ir kurios visiškai simuliacijos metu nebuvo vykdomos. Ar norite panaikinti žymėjimą šioms funkcijoms?
There are some functions highly executed in simulation. Do you want to unselect those functions? = Aptiktos funkcijos, kurios buvo dažnai vykdomos simuliacijos metu. Ar norite panaikinti žymejimą šioms funkcijoms?
There are some functions not executed in simulation. Do you want to unselect those functions? = Aptiktos funkcijos, kurios nebuvo vykdomos išvis simuliacijos metu. Ar norite panaikinti žymėjimą šioms funkcijoms?
Messages exported to: = Žinutės eksportuotos į:
Messages imported from: = Žinutės importuotos iš:
WinLicense GUI Overview = WinLicense GUI Apžvalga
Trial Settings = Bandymo nustatymai
Trial SDK = Bandymo SDK
Registration SDK = Registracijos SDK
Password Protection = Slaptažodžio apsauga
Miscellaneous SDK = Įvairūs SDK
Hardware Lock = Aparatinės mašinos fiksavimas
WARNING: Protected in Trial Debug Mode = ĮSPĖJIMAS: Apsaugota Bandymo Derinimo Režime
Click and select here = Spustelkite ir pažymėkite čia
ERROR: None of the functions handlers where specified in DLL Control = KLAIDA: Nerasti funkcijų manipuliatoriai DLL tvarkyklėje
Sorry, WinLicense DEMO does not support RISC-128 processors = Atsiprašome, WinLicense DEMO nepalaiko RISC-128 procesoriaus
Sorry, WinLicense DEMO does not support Dynamic Opcodes = Atsiprašome, WinLicense DEMO nepalaiko Dinaminių opkodų
Signature Level 2 is not accepted for the current Software. Please, go to the Sofware Panel and re-create a new License Hash for your software = Antro lygio parašas nepriimtas šiai programai. Nueikite į programos panelę ir sukurkite naują Licenzijos maišatį (hash) jūsų programai
.NET Module = .NET Modulis
File has a missing macro START or END. Please review your macros again: = Byloje nerastos makro komandos START arba END. Patikrinkite makro komadas dar kartą:
File cannot be opened. Make sure that other application is not using it: = Nepavyko atverti bylos. Patikrinkite ar kitos aplikacijos šiuo metu nenaudoja šios bylos:
File has an invalid PE header. Unable to inspect file: = Byla turi netaisyklingą PE aprašą. Nepavyko išnagrynėti bylos:
File contains one macro with few lines of code on it. Please review your macros again: = Byla turi vieną makrosą su keliomis kodo eilutėmis. Patikrinkite dar kartą makro komandas:
Deep file analysis in progress = Atliekama gili bylos analizė
File analysis in progress = Atliekama bylos analizė
Please wait... = Prašom palaukti...
Analyzing CodeReplace macros = Analizuojami CodeReplace makrosai
Are you sure you want to remove the selected Hardware ID? = Ar tikrai norite pašalinti pasirinktą aparatinio įrenginio ID?
List of Banned  Hardware IDs: = Sąrašas blokuotu aparatinių įrenginių ID:
Add = Pridėti
Remove = Pašalinti
Done = Atlikta
Generating License Hash = Generuojama Licenzijos maišatis (hash)
Generate Password = Generuoti slaptažodį
Password Generation = Slaptažodžio generavimas
Store generated Passwords in folder: = Išsaugoti sugeneruotus slaptažodžius aplanke:
Total Passwords: = Iš viso slaptažodžių:
Do you want to delete the selected record? = Ar tikrai norite pašalinti pasirinktą įrašą?
Password file generated in folder: = Slaptažodžių byla sugeneruota aplanke:
Password Generator = Slaptažodžių generatorius
Password Manager = Slaptaždžių Tvarkytojas
Details = Detalės

Add Password = Pridėti slaptažodį
Edit Password = Redaguoti slaptažodį
Please, select a customer to generate the password = Norint sugeneruoti slaptažodį, prašom pasirinkti klientą
Please, select a software to generate the password = Norint sugeneruoti slaptažodį, prašom pasirinkti programą
Rolling back your actions = Atstatomi atgal jūsų veiksmai

Generate Extension = Generavimo plėtiniai
Level = Lygis
Trial Extension Generation = Laikinų praplėtimų generavimas
Store generated Extensions in folder: = Išsaugoti sugeneruotus praplėtimus aplanke:
Generate File Key = Generuoti Bylos Raktą
Generate Registry Key = Generuoti Registro Raktą
Trial extension key/s generated in folder: = Laikinųjų praplėtimų raktas (-ai) sugeneruoti ir išsaugoti aplanke: 
Trial Extension Generator = Laikinųjų Praplėtimų Generatorius
Edit = Redaguoti
Add Trial Extension = Pridėti Laikinąjį Praplėtimą
Edit Trial Extension = Redaguoti Laikinąjį Praplėtimą
Please, select a software to generate the trial extension = Prašom pasirinkti programą, kuriai norėtumėte sugeneruoti laikinuosius praplėtimus

Warning: Trial in Debug Mode = Įspėjimas: Laikinoji versija yra derinimo režime
Debug Mode Trial = Derinimo režimas laikinojoje versijoje
The application that you are going to protect will not include the SecureEngine Trial Storing Manager*. = Aplikaciją, kurią ruošiatės apsaugoti neįtrauks SecureEngine Laikinojo Saugojimo Valdytojo*.
The trial information will be stored under the registry key: = Laikinoji informacija bus išsaugota registre raktu:
(You can access to that key to reset/test the WinLicense Trial Engine) = (Jūs galite prieiti prie šio rakto, norint atitaisyti/testuoti WinLicense laikinąjį variklį)
*To enable the SecureEngine Trial Storing Manager, uncheck the option "Trial in debug mode" in the Protect screen. = *Tam, kad būtų įjungtas SecureEngine Laikinasis Saugojimo Valdytojas, nuimkite žymėjimą ties opcija "Laikinoji versija derinimo režime" apsaugos ekrane.
Don't show this screen again = Nerodyti šio vaizdo daugiau

Do you want to delete the selected client? = Ar tikrai norite pašalinti pasirinktą klientą?
Enter new Hardware ID to ban: = Įveskite naują aparatinės mašinos ID, kurį norite blokuoti:
The entered Hardware ID does not seem to be valid (must be at least 32 chars) Please, enter a valid Hardware ID = Įvestas aparatinės mašinos ID nėra teisingas (turi būti bent 32 simboliai) Įveskite naują galiojantį aparatinės mašinos ID

File has a missing macro START or END. Please correct this error before protecting: = Byloje nerastos makro komandos START arba END. Ištaisykite šias klaidas prie pradedant apsaugos veiksmus:
File has an invalid PE header. Unable to protect: = Byla turi netaisyklingą PE aprašą. Nepavyko apsaugoti:
File contains one macro with few lines of code on it. Please review your macros before protecting: = Byla turi vieną makrosą su keliomis kodo eilutėmis. Patikrinkite dar kartą makro komandas:
The input file seems to be in use. Please, close the file to proceed with protection: = Panašu, kad įvesties byla šiuo metu yra naudojama. Uždarykite šią bylą prieš pradedant apsaugojimo veiksmus:

Code Virtualization = Kodo virtualizavimas
Virtual Opcodes Obfuscation = Virtualių opkodų painiojimas
Current: = Dabartinis:
Virtual Machine Complexity = Virtualios Mašinos Kompleksiškumas
Size (Approx): = Dydis (Apytiksliai):
Opcodes Mutation = Opkodų Mutacija
Multiple Virtual Machines = Daugelypės Virtualios Mašinos
NumVMs * SizeVM: = Skaičius VM'ų * Dydis VM:
Fake Stack Emulation = Falsifikuoto Steko emuliacija
Strip Relocations (EXEs) = Pašalinti perkėlimus (EXEs)
Strip relocations = Pašalinti perkėlimus
Re-Virtualization = Iš naujo virtualizuoti
Multi Branch Technology = Multi-Atšakų Technologija
Fake Emulation = Falsifikuota Emuliacija
Keep original name = Išsaugoti originalų vardą
Functions that will be virtualized: = Funkcijos, kurios bus virtualizuojamos:

You can customize how complex will be the Virtual Machine opcodes. The size of the generated opcodes depend on the complexity selected = Galite nurodyti kiek kompleksiški bus Virtualios Mašinos opkodai. Sugeneruotų opkodų dydis priklauso nuo to, kokį kompleksiškumo lygį pasirinkote
You can customize how complex the generated virtual machine will be. The size of the virtual machine depends on the complexity that you select = Galite nustatyti kokio kompleksiškumo bus sugeneruota Virtuali Mašina. Dydis Virtualios Mašinos priklauso nuo to, kokį kompleksiškumo lygį pasirinkote
You can mutate the internal virtual opcodes, generating a more complex virtual machine = Galite nustatyti, kad vidinės virtualios mašinos opkodai bus mutuojami, generuojant didesnio kompleksiškumo virtualią mašiną
The generad Virtual Machine and virtual opcodes will be placed inside the last section of your application. You can rename the last section of your application as desired = Sugeneruota virtuali mašina ir virtualūs opkodai jūsų aplikacijoje bus išsaugoti paskutinės sekcijos viduje. Galite pervadinti aplikacijos paskutinę sekciją taip kaip jums patinka 
You can create several Virtual Machines inside your protected application. Each Virtual Machine will process specific blocks of code in your application = Apsaugotoje aplikacijoje galite sukurti keletą virtualių mašinų. Kiekviena Virtuali Mašina vykdys jūsų aplikacijos specifinius kodo blokus
This option will assume the stack to be initilized to zero for all not allocated entries in stack. This option should be enabled for PureBasic applications = Bus laikoma, kad stekas initializuojamas  nulinėmis reikšmėmis visiems nealokuotiems steko įrašams. Ši opcija turėtų būti naudojama PureBasic aplikacijoms
You can remove the relocations section from the PE header for EXE files, reducing the size of the final protected application = Jūs galite pašalinti perkėlimų sekcija iš PE aprašo EXE bylose, taip sumažinant galutinės apsaugotos aplikacijos dydį
Re-Virtualization is an extremely powerful technique against Reverse Engineering. But it can decrease a lot the performance in speed in the protected blocks.  Please, check the performance of your application when protected with Re-Virtualization = Pakartotinis virtualizavimas yra puiki technika apsisaugojant nuo apgrąžos inžinerijos. Bet tai gali stipriai pakenkti programos apsaugotų blokų efektyvumui, greičio atžvilgiu. Patikrinkite aplikacijos efektyvumą, kai naudojate pakartotinį virtualizavimą
This option will insert multiple conditional branch instructions inside your unique virtual machine, making it harder to analyse = Ši opcija įterpia daugialypes sąlygos atšakas unikalios Virtualios Mašinos viduje, tai stipriai pasunkina aplikacijos analizavimą

Please, select an application to protect = Prašom, pasirinkti aplikaciją, kurią norite apsaugoti
The selected application does not have any functions to virtualize. Please insert functions using the SDK = Pasirinkta aplikacija neturi jokių funkcijų, kurias būtų galima virtualizuoti. Įterpkite funkcijas, aprašytas SDK
All functions to virtualize were disabled. Please, select at least one = Visos virtualizuojamos funkcijos yra išjungtos. Pasirinkite, bent vieną funkciją
Warning! A macro with no code inside has been found. This might be due to compiler optimizations. Please, disable your compiler optimizations or review each macro. = Įspėjimas! Buvo aptiktas makrosas be jokio kodo viduje. Taip galėjo nutikti dėl kompiliatoriaus optimizavimo. Išjunkite kompiliatoriaus optimizavimą arba peržvelkite kiekvieną makro kodą.
Virtual Functions = Virtualios Funkcijos
Inserted via "Call VarPtr": = Įterpta naudojant "Call VarPtr":
Inserted via inline Assembly: = Įterpta naudojant įterpiamą asemblerinį kodą:
Inserted via auxiliar API: = Įterpta naudojant pagalbinę API-sąsają:
Inserted via MAP file: = Įterpta naudojant MAP bylą:
NO FUNCTIONS FOUND TO VIRTUALIZE!!! = NEAPTIKTOS FUNKCIJOS KURIAS GALIMA VIRTUALIZUOTI!!!
(Application header has been rebuilt by Code Virtualizer) = (Kodo Virtualizuotojas rekonstravo aplikacijos aprašą)
Protecting an Application = Apsaugojama Aplikacija
Learn About Virtualizer = Sužinokite apie Virtualizuotoją
Code Virtualization = Kodo Virtualizavimas
Code Virtualize Macros = Kodo Virtualizavimo Makrosai
**** Sorry, the DEMO version does not support protection via command line **** = **** Atsiprašome, DEMO versija nepalaiko apsaugos naudojant komandinę eilutę ****
*** ERROR: File to protect cannot be acccessed. (Exit code 2) *** = *** KLAIDA: Nepavyko prieiti prie failo, kuris turi būti apsaugotas (Pabaigos kodas 2) ***
*** ERROR: File does not have any blocks to protect. (Exit code 3) *** = *** KLAIDA: Byla neturi jokių blokų, kuriuos būtų galima apsaugoti (Pabaigos kodas 3) ***
*** ERROR: File to protect cannot be opened. (Exit code 5) *** = *** KLAIDA: Nepavyko atverti bylos, kuri turi būti apsaugota (Pabaigos kodas 5) ***
Generating Specific Virtual Machine = Generuojama Specifinė Virtuali Mašina
Virtualizing Function = Virtualizuojamos Funkcijos
Re-Virtualizing ... = Re-Virtualizuojama ...
Flushing file ... = Užbaigiama byla ...
Sorry, the DEMO version only allows one Virtual Machine per application = Atsiprašome, DEMO versija palaiko vienai aplikacijai tik vieną Virtualią Mašiną
Sorry, the DEMO version does not support Re-Virtualization = Atsiprašome, DEMO versija nepalaiko Re-Virtualizacijos
The application is already protected. You cannot protect an already protected application in the DEMO version = Ši aplikacija jau yra apsaugota. DEMO versijoje jūs negalite apsaugoti aplikacijos, kuri jau yra apsaugota
The Input application cannot be accessed. Please, check that the application is not in use: = Nepavyko prieiti prie įvesties aplikacijos. Patikrinkite ar aplikacija šio metu nėra naudojama: 
The Output application cannot be accessed. Please, check that the application path is valid or file is not in use: = Nepavyko prieiti prie Išvesties aplikacijos. Patikrinkite ar kelias yra teisingas ir ar byla nėra naudojama šiuo metu:
Limitations in DEMO version: = DEMO versijos apribojimai:
Virtual Opcodes Obfuscation set to NORMAL = Virtualių opkodų painiojimas nustatytas į NORMALŲ
Virtual Machine Complexity set to NORMAL = Virtualios Mašinos Kompleksiškumas nustatytas į NORMALŲ
Only ONE macro is virtualized = Tik VIENAS makrosas buvo virtualizuotas
The Output application cannot be accessed. Please, check that the application is not in use: = Nepavyko prieiti prie išvesties aplikacijos. Patikrinkite ar ši aplikacija dabar nėra naudojama:
PE Information = PE Informacija
Input PE file: = Įvesties PE byla:
Output PE file: = Išvesties PE byla:
Virtual Functions found: = Aptiktos Virtualios Funkcijos:
PE file analysis... OK! = PE bylos analizė... OK!
Virtualization = Virtualizacija
Generating Specific Virtual Machine = Generuojama specifinė Virtuali Mašina
Size: = Dydis:
Virtualizing Function = Virtualizuojamos Funkcijos
Start: = Pradėti:
Skipped = Praleista
bytes = baitai
Cancelling... = Nutraukiama...
Re-Virtualization = Re-Virtualizacija
Re-Virtualizing ... = Re-Virtualizuojama...
Final Stats = Galutinė statistika
Virtualized Functions: = Virtualizuotos Funkcijos:
Skipped Functions: = Praleistos Funkcijos:
Errors: = Klaidos:
Increase in size: = Padidėjimas:
Application successfully protected! = Aplikacija buvo sėkmingai apsaugota!
Protection CANCELLED! = Apsaugojimas NUTRAUKTAS!
Do you really want to Cancel the protection process? = Ar tikrai norite nutraukti apsaugojimo procesą?
Cancel Protection = Nutraukti Apsaugojimą

Select a Software to protect from the WinLicense database = Iš WinLicense duomenų bazės išsirinkite programą, kurią norite apsaugoti
